cask_args appdir: '/Applications'
tap 'homebrew/bundle'

tap 'universal-ctags/universal-ctags'
brew 'universal-ctags'

tap 'neovim/neovim'
brew 'neovim'
brew 'vim', args: ['with-lua', 'with-override-system-vi']

brew 'tmux'

brew 'fzf'
brew 'massren'
brew 'the_silver_searcher'
brew 'jq'

brew 'git'
brew 'diff-so-fancy'

tap 'thoughtbot/formulae'
brew 'thoughtbot/formulae/gitsh'
brew 'thoughtbot/formulae/rcm'

brew 'dnsmasq'
brew 'ngrok'

brew 'chruby'
brew 'ruby-build'

cask '1password'
cask 'firefox'
cask 'transmission'
cask 'vlc'
cask 'iterm2'
cask 'vagrant'
