cask_args appdir: '/Applications'
tap 'homebrew/bundle'

tap 'universal-ctags/universal-ctags'
brew 'universal-ctags'

brew 'zsh'

tap 'neovim/neovim'
brew 'neovim'
brew 'vim', args: ['with-lua', 'with-override-system-vi']
brew 'reattach-to-user-namespace'

# cli!
brew 'tmux'
brew 'ranger'
brew 'mutt'
brew 'fzf'

brew 'the_silver_searcher'
brew 'laurent22/massren/massren'
brew 'jq'
brew 'curl'
brew 'wget'

brew 'tree'
brew 'git'
brew 'diff-so-fancy'

tap 'thoughtbot/formulae'
brew 'thoughtbot/formulae/gitsh'
brew 'thoughtbot/formulae/rcm'

brew 'dnsmasq'
brew 'mobile-shell'
brew 'weechat'
brew 'ngrok'
brew 'rsync'
brew 'nmap'

brew 'chruby'
brew 'ruby-build'
brew 'elixir'
# brew 'leiningen'
# brew 'cabal-install'
brew 'hugo'

brew 'johanhaleby/kubetail/kubetail'
brew 'kubernetes-helm'
brew 'kops'

cask '1password'
cask 'firefox'
cask 'transmission'
cask 'vlc'
cask 'iterm2'
cask 'vagrant'
