cask_args appdir: '/Applications'
tap 'homebrew/bundle'

tap 'universal-ctags/universal-ctags'
brew 'universal-ctags'

brew 'zsh'

tap 'neovim/neovim'
brew 'neovim'
brew 'vim', args: ['with-lua', 'with-override-system-vi']
brew 'reattach-to-user-namespace'

# cli!
brew 'tmux'
brew 'ranger'
brew 'mutt'
brew 'fzf'

brew 'ripgrep'
brew 'fd'
brew 'laurent22/massren/massren'
brew 'jq'
brew 'curl'
brew 'wget'

brew 'tree'
brew 'git'
brew 'diff-so-fancy'

tap 'thoughtbot/formulae'
brew 'thoughtbot/formulae/gitsh'
brew 'thoughtbot/formulae/rcm'

brew 'dnsmasq', restart_service: true
brew 'mobile-shell'
brew "weechat", args: ["with-perl", "with-python"]
brew 'ngrok'
brew 'rsync'
brew 'nmap'
brew 'gor'
#brew 'dhex'

# brew 'postgresql', restart_service: true
#brew "mariadb", restart_service: true

brew 'chruby'
brew 'ruby-build'
brew 'elixir'
# brew 'leiningen'
# brew 'cabal-install'
brew 'hugo'
brew 'watchman'

tap 'theseal/ssh-askpass'
brew "theseal/ssh-askpass/ssh-askpass"

brew 'johanhaleby/kubetail/kubetail'
brew 'kubernetes-helm'
brew 'kops'

cask 'ngrok'
cask '1password'
cask "caskroom/versions/firefoxnightly"
cask 'transmission'
cask 'vlc'
cask 'iterm2'
cask 'vagrant'
cask "hammerspoon"
cask "iina"
cask "imageoptim"
cask "iterm2"
cask "karabiner"
