
# terminal
alacritty-git

base

# base-devel
autoconf
automake
binutils
bison
fakeroot
flex
gcc
groff
libtool
m4
make
patch
pkgconf
sudo
texinfo
which

# for wifi
connman
iwd
iw

# for bluetooth
bluez-utils
blueman

# vim
ctags

dialog

# git
diff-so-fancy

# surface acpi stuff
asp
dkms
dmidecode
hidrd-git
hwinfo
acpi_call-dkms
acpica
i2c-tools

# CPU firmware
intel-ucode
# hardware acceleration
intel-media-driver
libva-utils
# sound firmware
sof-firmware

elixir

# utils
exa
fasd
fd
fzf
git
htop
jq
kubectl
mosh
mpd
mpv
mutt
nano
vim
neovim
nmap
man-db
ranger
nnn
rcm
ripgrep
rsync
sd
tmux
tree
wget
weechat
zsh
zsh-completions
watchman

powertop
tlp

etckeeper

openssh
mesa

# audio
pavucontrol
pulseaudio
pulseaudio-alsa
pulseaudio-bluetooth
alsa-utils

python-pip
upower
youtube-dl
keybase
keybase-gui
redshift-wlr-gamma-control-git

# includes docker
docker-compose

# firefox development
mercurial
ccache
gdb
# libinput dev
meson

# AUR
yay

# applications
evince
firefox-developer-edition
vlc
transmission-cli
transmission-gtk
telegram-desktop

imv
aerc

# sway
grim
libinput-gestures
libnotify
light
mako
rofi
slurp
sway
swaylock
waybar
ydotool-git
wl-clipboard
wl-clipboard-x11
qt5-wayland
xorg-server-xwayland

# kernel
linux
linux-firmware
linux-headers
linux-surface-dev
linux-surface-dev-docs
linux-surface-dev-headers

systemd-swap

# fonts & themes
ttf-fira-code
ttf-fira-mono
ttf-fira-sans
ttf-inter-ui
ttf-linux-libertine
ttf-proggy-clean
ttf-roboto
terminus-font
noto-fonts-cjk
otf-font-awesome
paper-icon-theme

